<a href="https://colab.research.google.com/github/sandeep111020/machine_learning/blob/master/titanic_prediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [278]:
import pandas as pd
df = pd.read_csv("/content/drive/My Drive/train.csv")
dfo = pd.read_csv("/content/drive/My Drive/test.csv")
dfo.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [279]:
df.drop(['Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True) 
dfo.drop(['Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns', inplace=True)
df.head()

   PassengerId  Survived  Pclass     Sex   Age     Fare
0            1         0       3    male  22.0   7.2500
1            2         1       1  female  38.0  71.2833
2            3         1       3  female  26.0   7.9250
3            4         1       1  female  35.0  53.1000
4            5         0       3    male  35.0   8.0500

In [280]:
inputs = df.drop(['Survived'],axis='columns')
target = df.Survived

In [281]:
dfo['Survived'] = 0
inputso = dfo.drop(['Survived'],axis='columns')
targetso = dfo.Survived

In [282]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [283]:
dummieso = pd.get_dummies(inputso.Sex)
dummieso.head()

   female  male
0       0     1
1       1     0
2       0     1
3       0     1
4       1     0

In [284]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   PassengerId  Pclass     Sex   Age     Fare  female  male
0            1       3    male  22.0   7.2500       0     1
1            2       1  female  38.0  71.2833       1     0
2            3       3  female  26.0   7.9250       1     0
3            4       1  female  35.0  53.1000       1     0
4            5       3    male  35.0   8.0500       0     1

In [285]:
inputso = pd.concat([inputso,dummieso],axis='columns')
inputso.head()

   PassengerId  Pclass     Sex   Age     Fare  female  male
0          892       3    male  34.5   7.8292       0     1
1          893       3  female  47.0   7.0000       1     0
2          894       2    male  62.0   9.6875       0     1
3          895       3    male  27.0   8.6625       0     1
4          896       3  female  22.0  12.2875       1     0

In [286]:
inputs.drop(['female','Sex'],axis='columns', inplace=True)
inputs.head()

   PassengerId  Pclass   Age     Fare  male
0            1       3  22.0   7.2500     1
1            2       1  38.0  71.2833     0
2            3       3  26.0   7.9250     0
3            4       1  35.0  53.1000     0
4            5       3  35.0   8.0500     1

In [287]:
inputso.drop(['female','Sex'],axis='columns',inplace=True)
inputso.head()

   PassengerId  Pclass   Age     Fare  male
0          892       3  34.5   7.8292     1
1          893       3  47.0   7.0000     0
2          894       2  62.0   9.6875     1
3          895       3  27.0   8.6625     1
4          896       3  22.0  12.2875     0

In [288]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [289]:
inputso.Age[:10]

0    34.5
1    47.0
2    62.0
3    27.0
4    22.0
5    14.0
6    30.0
7    26.0
8    18.0
9    21.0
Name: Age, dtype: float64

In [290]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   PassengerId  Pclass   Age     Fare  male
0            1       3  22.0   7.2500     1
1            2       1  38.0  71.2833     0
2            3       3  26.0   7.9250     0
3            4       1  35.0  53.1000     0
4            5       3  35.0   8.0500     1

In [291]:
inputso.Age = inputso.Age.fillna(inputso.Age.mean())
inputso.head()

   PassengerId  Pclass   Age     Fare  male
0          892       3  34.5   7.8292     1
1          893       3  47.0   7.0000     0
2          894       2  62.0   9.6875     1
3          895       3  27.0   8.6625     1
4          896       3  22.0  12.2875     0

In [292]:
#from sklearn.linear_model import LogisticRegression
#model = LogisticRegression()#78.7#63

In [293]:

#from sklearn.model_selection import train_test_split
#X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [294]:
X_train =inputs
X_test = inputso
y_train = target
y_test = targetso

In [295]:
X_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    int64
 2   Age          891 non-null    float64
 3   Fare         891 non-null    float64
 4   male         891 non-null    uint8
dtypes: float64(2), int64(2), uint8(1)
memory usage: 28.8 KB

In [296]:
X_test = X_test.fillna(X_test.mean())

In [297]:
X_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Age          418 non-null    float64
 3   Fare         418 non-null    float64
 4   male         418 non-null    uint8
dtypes: float64(2), int64(2), uint8(1)
memory usage: 13.6 KB

In [298]:
#from sklearn import tree
#model = tree.DecisionTreeClassifier()#75#65

In [299]:
from sklearn.ensemble import RandomForestClassifier
model = RandomForestClassifier(n_estimators=20)#82#66

In [300]:
#from sklearn.naive_bayes import GaussianNB
#model = GaussianNB()#78#58

In [303]:
model.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=20,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [305]:
y_test = model.predict(X_test)
y_test

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1,
       0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0])

In [302]:

dfo.Survived = y_test
dfo.drop(['Pclass','Sex','Age','Fare'],axis='columns',inplace=True)

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [309]:
dfo.to_csv('/content/drive/My Drive/titanic.csv')